In [3]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
threshold = 30
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [2]:
# Question: How do you select rows from a DataFrame where any value in the row exceeds a threshold?
selected_rows = df[(df > threshold).any(axis=1)]
print(selected_rows)

   A   B
3  4  40
4  5  50

In [4]:
df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})
df

   A  B  C
0  2  2  1
1  1  3  2
2  2  1  3

In [5]:
# Question: How do you sort a DataFrame by columns `A` and `B`?
sorted_df = df.sort_values(by=['A', 'B'])
print(sorted_df)

   A  B  C
1  1  3  2
2  2  1  3
0  2  2  1

In [7]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
df1

   A  B
0  1  4
1  2  5
2  3  6

In [8]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [12]:
# Question: How do you concatenate two DataFrames vertically?
concatenated_df = pd.concat([df1, df2])
print(concatenated_df)

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

In [13]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})
df

   A
0  1
1  2
2  3
3  4
4  5

In [14]:
# Question: How do you compute the cumulative sum of a column in a DataFrame?
df['Cumulative_Sum'] = df['A'].cumsum()
print(df)

   A  Cumulative_Sum
0  1               1
1  2               3
2  3               6
3  4              10
4  5              15

In [15]:
series = pd.Series(['apple', 'banana', 'cherry'])
series

0     apple
1    banana
2    cherry
dtype: object

In [16]:
# Question: How do you convert a Series of strings to uppercase?
uppercase_series = series.str.upper()
print(uppercase_series)

0     APPLE
1    BANANA
2    CHERRY
dtype: object